In [ ]:
#Creating a DataFrame
import numpy as np
import pandas as pd

In [10]:
Data = {
    'Name':['shivam','sujeet','khemraj sir', 'vineeta'],
    'Age' :[18,16,40,36],
    'city':[ 'delhi','Mumbai','Goa','Dubai'],
    'Salary':[200000,1000000,25000,30000]
}
sh = pd.DataFrame(Data)

In [11]:
sh

          Name  Age    city   Salary
0       shivam   18   delhi   200000
1       sujeet   16  Mumbai  1000000
2  khemraj sir   40     Goa    25000
3      vineeta   36   Dubai    30000

In [12]:
data_list = [
['shivam',	18	,'delhi',	200000],
['sujeet',	16	,'Mumbai'	,1000000],
['khemraj sir',	40	,'Goa'	,25000],
['vineeta',	36	,'Dubai',	30000]
]

sh2 = pd.DataFrame(data_list)
columns = [ 'Name','Age','City','Salary']
sh2 = pd.DataFrame(data_list, columns=columns)
sh2

          Name  Age    City   Salary
0       shivam   18   delhi   200000
1       sujeet   16  Mumbai  1000000
2  khemraj sir   40     Goa    25000
3      vineeta   36   Dubai    30000

In [13]:
sh2

          Name  Age    City   Salary
0       shivam   18   delhi   200000
1       sujeet   16  Mumbai  1000000
2  khemraj sir   40     Goa    25000
3      vineeta   36   Dubai    30000

In [14]:
#Selection and Indexing of Columns
sh2

          Name  Age    City   Salary
0       shivam   18   delhi   200000
1       sujeet   16  Mumbai  1000000
2  khemraj sir   40     Goa    25000
3      vineeta   36   Dubai    30000

In [15]:
sh2[['Name','City']]

          Name    City
0       shivam   delhi
1       sujeet  Mumbai
2  khemraj sir     Goa
3      vineeta   Dubai

In [17]:
sh2[['Name','Salary']]

          Name   Salary
0       shivam   200000
1       sujeet  1000000
2  khemraj sir    25000
3      vineeta    30000

In [18]:
sh2[['Name', 'Age']]

          Name  Age
0       shivam   18
1       sujeet   16
2  khemraj sir   40
3      vineeta   36

In [ ]:
#Creating a new column

In [19]:
sh2

          Name  Age    City   Salary
0       shivam   18   delhi   200000
1       sujeet   16  Mumbai  1000000
2  khemraj sir   40     Goa    25000
3      vineeta   36   Dubai    30000

In [20]:
sh2["Genger"] = ["male","male","male","female"]

In [21]:
sh2

          Name  Age    City   Salary  Genger
0       shivam   18   delhi   200000    male
1       sujeet   16  Mumbai  1000000    male
2  khemraj sir   40     Goa    25000    male
3      vineeta   36   Dubai    30000  female

In [ ]:
#Removing Columns

In [ ]:
sh2.drop(1,axis= 1)

          Name  Age    City   Salary  Genger
1       sujeet   16  Mumbai  1000000    male
2  khemraj sir   40     Goa    25000    male
3      vineeta   36   Dubai    30000  female

In [26]:
sh2

          Name  Age    City   Salary  Genger
0       shivam   18   delhi   200000    male
1       sujeet   16  Mumbai  1000000    male
2  khemraj sir   40     Goa    25000    male
3      vineeta   36   Dubai    30000  female

In [ ]:
#Selecting Rows

In [27]:
sh2

          Name  Age    City   Salary  Genger
0       shivam   18   delhi   200000    male
1       sujeet   16  Mumbai  1000000    male
2  khemraj sir   40     Goa    25000    male
3      vineeta   36   Dubai    30000  female

In [28]:
sh2.loc[[2,3]]

          Name  Age   City  Salary  Genger
2  khemraj sir   40    Goa   25000    male
3      vineeta   36  Dubai   30000  female

In [30]:
sh2.loc[[0,3]]

      Name  Age   City  Salary  Genger
0   shivam   18  delhi  200000    male
3  vineeta   36  Dubai   30000  female

In [31]:
sh2

          Name  Age    City   Salary  Genger
0       shivam   18   delhi   200000    male
1       sujeet   16  Mumbai  1000000    male
2  khemraj sir   40     Goa    25000    male
3      vineeta   36   Dubai    30000  female

In [32]:
sh2.iloc[[2]]

          Name  Age City  Salary Genger
2  khemraj sir   40  Goa   25000   male

In [33]:
sh2.iloc[3]

Name      vineeta
Age            36
City        Dubai
Salary      30000
Genger     female
Name: 3, dtype: object

In [34]:
sh2.iloc[1]

Name       sujeet
Age            16
City       Mumbai
Salary    1000000
Genger       male
Name: 1, dtype: object

In [35]:
sh2

          Name  Age    City   Salary  Genger
0       shivam   18   delhi   200000    male
1       sujeet   16  Mumbai  1000000    male
2  khemraj sir   40     Goa    25000    male
3      vineeta   36   Dubai    30000  female

In [ ]:
#Selecting Subsets of Rows and Columns

In [36]:
sh2

          Name  Age    City   Salary  Genger
0       shivam   18   delhi   200000    male
1       sujeet   16  Mumbai  1000000    male
2  khemraj sir   40     Goa    25000    male
3      vineeta   36   Dubai    30000  female

In [37]:
sh2.loc[[2,3]][['Name','Salary']]

          Name  Salary
2  khemraj sir   25000
3      vineeta   30000

In [38]:
sh2.loc[[0,2]][['City','Genger']]

    City Genger
0  delhi   male
2    Goa   male

In [ ]:
#Conditional Selection

In [39]:
sh2

          Name  Age    City   Salary  Genger
0       shivam   18   delhi   200000    male
1       sujeet   16  Mumbai  1000000    male
2  khemraj sir   40     Goa    25000    male
3      vineeta   36   Dubai    30000  female

In [40]:
sh2[sh2["Age"] > 20]

          Name  Age   City  Salary  Genger
2  khemraj sir   40    Goa   25000    male
3      vineeta   36  Dubai   30000  female

In [43]:
sh2[sh2["Salary"] > 100000]

     Name  Age    City   Salary Genger
0  shivam   18   delhi   200000   male
1  sujeet   16  Mumbai  1000000   male